coocox/Mplib/Toshaba/TMPM36x/TMPM362/cmsis_lib/lib/include/tmpm362_gpio.h
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PL_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PL_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PL_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PL_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PL_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PL_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PL_FR3_BIT_ALL                      ((uint8_t)0x40)

#define GPIO_PM_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PM_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PM_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PM_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PM_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PM_FR2_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PM_FR3_BIT_ALL                      ((uint8_t)0x11)

#define GPIO_PN_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PN_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PN_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PN_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PN_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PN_FR2_BIT_ALL                      ((uint8_t)0xCC)
#define GPIO_PN_FR3_BIT_ALL                      ((uint8_t)0xCC)

#define GPIO_PO_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PO_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PO_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PO_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PO_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PO_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PO_FR3_BIT_ALL                      ((uint8_t)0x44)

#define GPIO_PP_OUTPUT_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PP_PULLUP_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PP_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x7F)
#define GPIO_PP_INPUT_BIT_ALL                    ((uint8_t)0x7F)
#define GPIO_PP_FR1_BIT_ALL                      ((uint8_t)0x7F)
#define GPIO_PP_FR2_BIT_ALL                      ((uint8_t)0x3C)

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PC_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PD_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PE_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PF_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4))

#define IS_GPIO_PG_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PH_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

